mahdi-benhassen/AgriNetPro_gw_node/gateway/host/sdkconfig.defaults
# AgriNetPro Gateway - sdkconfig.defaults
# Target: ESP32-S3 (Wi-Fi host) + ESP32-H2 (802.15.4 RCP)

# Target Chip
CONFIG_IDF_TARGET="esp32s3"

# Zigbee
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y

# Partition table (OTA-ready)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Wi-Fi (for cloud connectivity)
CONFIG_ESP_WIFI_ENABLED=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# PSRAM (Highly recommended for S3 host in large mesh networks)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=-1
